Q1. What is a database? Differentiate between SQL and NoSQL databases.

A database is an organized collection of structured information, or data, typically stored electronically in a computer system. A database is usually controlled by a database management system (DBMS).

The table below summarizes the main differences between SQL and NoSQL databases.

|points | SQL Databases | NoSQL Databases|
|:-:|:-:|:-:|
|Data Storage Model|Tables with fixed rows and columns|Document: JSON documents, Key-value: key-value pairs, Wide-column: tables with rows and dynamic columns, Graph: nodes and edges|
|Development History|Developed in the 1970s with a focus on reducing data duplication|Developed in the late 2000s with a focus on scaling and allowing for rapid application change driven by agile and DevOps practices.|
|Examples|Oracle, MySQL, Microsoft SQL Server, and PostgreSQL|Document: MongoDB and CouchDB, Key-value: Redis and DynamoDB, Wide-column: Cassandra and HBase, Graph: Neo4j and Amazon Neptune|
|Primary Purpose|General purpose|Document: general purpose, Key-value: large amounts of data with simple lookup queries, Wide-column: large amounts of data with predictable query patterns, Graph: analyzing and traversing relationships between connected data|
|Schemas|Rigid|Flexible|
|Scaling|Vertical (scale-up with a larger server)|Horizontal (scale-out across commodity servers)|
|Multi-Record ACID Transactions|Supported|Most do not support multi-record ACID transactions. However, some — like MongoDB — do.|
|Joins|Typically required|Typically not required|
|Data to Object Mapping|Requires ORM (object-relational mapping)|Many do not require ORMs. MongoDB documents map directly to data structures in most popular programming languages.|

|Index	|SQL	|NoSQL|
|:-:|:-:|:-:|
|1)|	SQL Databases are categorized as Relational Database Management System (RDBMS).	|NoSQL databases are categorized as Non-relational or distributed database system.|
|2)|	SQL databases have fixed or static or predefined schema.	|NoSQL databases have dynamic schema.|
|3)|	SQL databases display data in form of tables so it is known as table-based database.|	NoSQL databases display data as collection of key-value pair, documents, graph databases or wide-column stores.|
|4)	|SQL databases are vertically scalable.	|NoSQL databases are horizontally scalable.|
|5)	|SQL databases use a powerful language "Structured Query Language" to define and manipulate the data.|	In NoSQL databases, collection of documents are used to query the data.| It is also called unstructured query language. It varies from database to database.|
|6)	|SQL databases are best suited for complex queries.	|NoSQL databases are not so good for complex queries because these are not as powerful as SQL queries.|
|7)	|SQL databases are not best suited for hierarchical data storage.	|NoSQL databases are best suited for hierarchical data storage.|
|8)	|MySQL, Oracle, Sqlite, PostgreSQL and MS-SQL etc. are the example of SQL database.	|MongoDB, BigTable, Redis, RavenDB, Cassandra, Hbase, Neo4j, CouchDB etc. are the example of nosql database|

Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

Data Definition Language(DDL) is a subset of SQL and a part of DBMS(Database Management System). DDL consist of Commands to commands like CREATE, ALTER, TRUNCATE and DROP. These commands are used to create or modify the tables in SQL.

CREATE :

This command is used to create a new table in SQL. The user has to give information like table name, column names, and their datatypes.


Syntax –


CREATE TABLE table_name
(
column_1 datatype,
column_2 datatype,
column_3 datatype,
....
);

In [10]:
import mysql.connector
mydb = mysql.connector.connect(  
   host="localhost",
   user="root",
   passwd="Gargi@5820"
)
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001F44C461250>

In [11]:
mycursor = mydb.cursor() 
mycursor.execute("CREATE DATABASE if not exists Student_info")
mycursor.execute("SHOW DATABASES") 
for x in mycursor:
    print(x)
mycursor.execute('CREATE TABLE if not exists Student_info.new_table(College_Id varchar(30) , College_name varchar(30), Branch varchar(10))')
mycursor.execute("insert into Student_info.new_table values('2', 'SNDT', 'banglore')")

('information_schema',)
('my_table',)
('mysql',)
('new_schema',)
('performance_schema',)
('student_info',)
('sys',)
('sys_1',)

In [12]:
mycursor.execute("SELECT * FROM Student_info.new_table")
for i in mycursor.fetchall():
    print(i)

('2', 'SNDT', 'banglore')

ALTER :
    
This command is used to add, delete or change columns in the existing table. The user needs to know the existing table name and can do add, delete or modify tasks easily.

Syntax –
Syntax to add a column to an existing table.

ALTER TABLE table_name
ADD column_name datatype;

In [13]:
mycursor.execute('ALTER TABLE Student_info.new_table ADD COLUMN CGPA_number4 INT')

In [14]:
mycursor.execute("insert into Student_info.new_table values('2', 'SNDT', 'banglore','10')")
mycursor.execute("SELECT * FROM Student_info.new_table")
for i in mycursor.fetchall():
    print(i)

('2', 'SNDT', 'banglore', None)
('2', 'SNDT', 'banglore', 10)

DROP:
     A DROP statement in SQL removes a component from a relational database management system (RDBMS).

Syntax:

DROP TABLE table_name;
or
DROP DATABASE database_name;

In [15]:
mycursor.execute("DROP TABLE Student_info.new_table")

In [16]:
mycursor.execute("SHOW DATABASES") 
for x in mycursor:
    print(x)

('information_schema',)
('my_table',)
('mysql',)
('new_schema',)
('performance_schema',)
('student_info',)
('sys',)
('sys_1',)

TRUNCATE TABLE:
    
The TRUNCATE TABLE command deletes the data inside a table, but not the table itself.

Syntax:

TRUNCATE TABLE  table_name;

In [17]:
mycursor.execute('CREATE TABLE if not exists Student_info.new_table(College_Id varchar(30) , College_name varchar(30), Branch varchar(10))')
mycursor.execute("insert into Student_info.new_table values('2', 'SNDT', 'banglore')")

In [18]:
mycursor.execute("SELECT * FROM Student_info.new_table")
for i in mycursor.fetchall():
    print(i)

('2', 'SNDT', 'banglore')

In [19]:
mycursor.execute("TRUNCATE TABLE Student_info.new_table")
for i in mycursor.fetchall():
    print(i)

Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

DML is an abbreviation for Data Manipulation Language. Represents a collection of programming languages explicitly used to make changes to the database, such as: CRUD operations to create, read, update and delete data. Using INSERT, SELECT, UPDATE, and DELETE commands.

INSERT − Insert data into a table.

UPDATE − Update existing data within a table.

DELETE − Delete records from a database table

In [20]:
import mysql.connector
mydb = mysql.connector.connect(  
   host="localhost",
   user="root",
   passwd="Gargi@5820"
)
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001F44C43ECD0>

In [21]:
mycursor = mydb.cursor() 
mycursor.execute("CREATE DATABASE if not exists Student_info")
mycursor.execute("SHOW DATABASES") 
for x in mycursor:
    print(x)
mycursor.execute('CREATE TABLE if not exists Student_info.new_table2(College_Id varchar(30) , College_name varchar(30), Branch varchar(10))')
mycursor.execute("insert into Student_info.new_table2 values('2', 'SNDT', 'banglore')")   
mycursor.execute("SELECT * FROM Student_info.new_table2")
for i in mycursor.fetchall():
    print(i)

('information_schema',)
('my_table',)
('mysql',)
('new_schema',)
('performance_schema',)
('student_info',)
('sys',)
('sys_1',)
('2', 'SNDT', 'banglore')

mycursor.execute("UPDATE Student_info.new_table2 SET College_Id = 3 WHERE College_name =SNDT ")

for i in mycursor.fetchall():
    
    print(i)

In [26]:
mycursor.execute("DELETE FROM Student_info.new_table2 WHERE College_Id = 2")

Q4. What is DQL? Explain SELECT with an example.

DQL statements are used for performing queries on the data within schema objects. The purpose of the DQL Command is to get some schema relation based on the query passed to it. We can define DQL as follows it is a component of SQL statement that allows getting data from the database and imposing order upon it. It includes the SELECT statement. This command allows getting the data out of the database to perform operations with it. When a SELECT is fired against a table or tables the result is compiled into a further temporary table, which is displayed or perhaps received by the program i.e. a front-end.

SELECT Statement in SQL
To fetch the entire table or all the fields in the table:

Syntax:

 SELECT * FROM table_name; 

 — asterisks represent all attributes of the table

In [34]:
mycursor = mydb.cursor() 
mycursor.execute("CREATE DATABASE if not exists Student_info")
mycursor.execute("SHOW DATABASES") 
for x in mycursor:
    print(x)
mycursor.execute('CREATE TABLE if not exists Student_info.new_table2(CustomerID INT PRIMARY KEY, CustomerName VARCHAR(50), LastName VARCHAR(50))')
mycursor.execute("insert into Student_info.new_table2 values(1, 'Shubham', 'Thakur')")
mycursor.execute("insert into Student_info.new_table2 values(2, 'Aman ', 'Chopra' )") 
mycursor.execute("insert into Student_info.new_table2 values(3, 'Naveen', 'Tulasi')") 
mycursor.execute("insert into Student_info.new_table2 values(4, 'Aditya', 'Arpan')") 
mycursor.execute("insert into Student_info.new_table2 values(5, 'Nishant. Salchichas S.A.', 'Jain')")

mycursor.execute("SELECT * FROM Student_info.new_table2")
print('\n')
for i in mycursor.fetchall():
    print(i)

('information_schema',)
('my_table',)
('mysql',)
('new_schema',)
('performance_schema',)
('student_info',)
('sys',)
('sys_1',)


('1', 'Shubham', 'Thakur')
('2', 'Aman ', 'Chopra')
('3', 'Naveen', 'Tulasi')
('4', 'Aditya', 'Arpan')
('5', 'Nishant. Salchichas S.A.', 'Jain')
('1', 'Shubham', 'Thakur')
('2', 'Aman ', 'Chopra')
('3', 'Naveen', 'Tulasi')
('4', 'Aditya', 'Arpan')
('5', 'Nishant. Salchichas S.A.', 'Jain')

Q5. Explain Primary Key and Foreign Key.

Let’s see the difference between Primary Key and Foreign Key:

|S.NO.	|PRIMARY KEY|	FOREIGN KEY|
|:-:|:-:|:-:|
|1|	A primary key is used to ensure data in the specific column is unique.	|A foreign key is a column or group of columns in a relational database table that provides a link between data in two tables.|
|2|	It uniquely identifies a record in the relational database table.	|It refers to the field in a table which is the primary key of another table.|
|3|	Only one primary key is allowed in a table.	|Whereas more than one foreign key are allowed in a table.|
|4|	It is a combination of UNIQUE and Not Null constraints.	|It can contain duplicate values and a table in a relational database.|
|5|	It does not allow NULL values.|	It can also contain NULL values.|
|6|	Its value cannot be deleted from the parent table.|	Its value can be deleted from the child table.|
|7|	It constraint can be implicitly defined on the temporary tables.|	It constraint cannot be defined on the local or global temporary tables.|

Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

In [39]:
import mysql.connector
mydb = mysql.connector.connect(  
   host="localhost",
   user="root",
   passwd="Gargi@5820"
)
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001F44C693210>

The MySQLCursor of mysql-connector-python (and similar libraries) is used to execute statements to communicate with the MySQL database. Using the methods of it you can execute SQL statements, fetch data from the result sets, call procedures. You can create Cursor object using the cursor() method of the Connection object/class.

execute()

This method accepts a MySQL query as a parameter and executes the given query.

In [40]:
mycursor = mydb.cursor() 
mycursor.execute("CREATE DATABASE if not exists Employee")
mycursor.execute("SHOW DATABASES") 
for x in mycursor:
    print(x)

('employee',)
('information_schema',)
('my_table',)
('mysql',)
('new_schema',)
('performance_schema',)
('student_info',)
('sys',)
('sys_1',)

Q7. Give the order of execution of SQL clauses in an SQL query.

SQL query execution order means optimizing our search results from the database or where the query clauses are evaluated according to the requirements.
Like how we plan something step by step and reach the final result, similarly, we use clauses in a particular order known as the SQL query execution order. Here is the table that shows the order in which the clauses are used.

|Order|	Clause|	Function|
|:-:|:-:|:-:|
|1|	FROM|	Tables are joined to get the base data.|
|2	|WHERE	|The base data is filtered.|
|3	|GROUP BY	|The filtered base data is grouped.|
|4	|HAVING	|The grouped base data is filtered.|
|5	|SELECT	|The final data is returned.|
|6	|ORDER BY	|The final data is sorted.|
|7	|LIMIT|	The returned data is limited to row count.|